# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Fri Mar 10 18:19:07 IST 2023

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design cache_controller

create_clock -name "clock" -period 2.0 -waveform {0.0 1.0} [get_ports clock]
set_clock_transition 0.1 [get_clocks clock]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_ADDRESS[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[64]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAIN[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports cpu_rw]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports cpu_val]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[64]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAIN[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports mem_ready]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports rst]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[64]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[63]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[62]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[61]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[60]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[59]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[58]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[57]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[56]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[55]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[54]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[53]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[52]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[51]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[50]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[49]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[48]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[47]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[46]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[45]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[44]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[43]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[42]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[41]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[40]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[39]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[38]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[37]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[36]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[35]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[34]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[33]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[32]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {CPU_DATAOUT[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_ADDRESS[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[64]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[63]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[62]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[61]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[60]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[59]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[58]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[57]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[56]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[55]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[54]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[53]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[52]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[51]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[50]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[49]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[48]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[47]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[46]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[45]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[44]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[43]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[42]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[41]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[40]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[39]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[38]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[37]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[36]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[35]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[34]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[33]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[32]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports {MEM_DATAOUT[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports mem_rw]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports mem_val]
set_output_delay -clock [get_clocks clock] -add_delay -max 0.8 [get_ports cache_ready]
set_input_transition 0.12 [get_ports clock]
set_input_transition 0.12 [get_ports rst]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[31]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[30]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[29]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[28]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[27]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[26]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[25]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[24]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[23]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[22]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[21]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[20]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[19]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[18]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[17]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[16]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[15]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[14]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[13]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[12]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[11]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[10]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[9]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[8]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[7]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[6]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[5]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[4]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[3]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[2]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[1]}]
set_input_transition 0.12 [get_ports {CPU_ADDRESS[0]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[64]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[63]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[62]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[61]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[60]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[59]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[58]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[57]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[56]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[55]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[54]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[53]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[52]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[51]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[50]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[49]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[48]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[47]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[46]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[45]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[44]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[43]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[42]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[41]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[40]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[39]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[38]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[37]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[36]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[35]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[34]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[33]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[32]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[31]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[30]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[29]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[28]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[27]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[26]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[25]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[24]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[23]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[22]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[21]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[20]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[19]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[18]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[17]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[16]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[15]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[14]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[13]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[12]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[11]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[10]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[9]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[8]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[7]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[6]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[5]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[4]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[3]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[2]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[1]}]
set_input_transition 0.12 [get_ports {CPU_DATAIN[0]}]
set_input_transition 0.12 [get_ports cpu_rw]
set_input_transition 0.12 [get_ports cpu_val]
set_input_transition 0.12 [get_ports {MEM_DATAIN[64]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[63]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[62]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[61]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[60]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[59]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[58]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[57]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[56]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[55]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[54]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[53]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[52]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[51]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[50]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[49]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[48]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[47]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[46]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[45]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[44]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[43]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[42]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[41]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[40]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[39]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[38]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[37]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[36]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[35]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[34]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[33]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[32]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[31]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[30]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[29]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[28]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[27]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[26]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[25]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[24]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[23]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[22]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[21]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[20]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[19]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[18]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[17]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[16]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[15]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[14]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[13]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[12]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[11]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[10]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[9]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[8]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[7]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[6]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[5]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[4]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[3]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[2]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[1]}]
set_input_transition 0.12 [get_ports {MEM_DATAIN[0]}]
set_input_transition 0.12 [get_ports mem_ready]
set_wire_load_mode "enclosed"
