create_clock -name clock -period 2 -waveform {0 1} [get_ports "clock"]
set_clock_transition -rise 0.1 [get_clocks "clock"]
set_clock_transition -fall 0.1 [get_clocks "clock"]
set_clock_uncertainity 0.01 [get_ports "clock"]
set_input_transition 0.12 [all_inputs]
set_input_delay -max 0.8 [get_ports "CPU_ADDRESS"] -clock [get_clocks "clock"]
set_input_delay -max 0.8 [get_ports "CPU_DATAIN"] -clock [get_clocks "clock"]
set_input_delay -max 0.8 [get_ports "cpu_rw"] -clock [get_clocks "clock"]
set_input_delay -max 0.8 [get_ports "cpu_val"] -clock [get_clocks "clock"]
set_input_delay -max 0.8 [get_ports "MEM_DATAIN"] -clock [get_clocks "clock"]
set_input_delay -max 0.8 [get_ports "mem_ready"] -clock [get_clocks "clock"]
set_input_delay -max 0.8 [get_ports "rst"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "cache_ready"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "CPU_DATAOUT"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "MEM_ADDRESS"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "MEM_DATAOUT"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "mem_rw"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "mem_val"] -clock [get_clocks "clock"]
set_output_delay -max 0.8 [get_ports "cache_ready"] -clock [get_clocks "clock"]


